Конфигурация/InformationRegisters/ТестированияSPPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ТестированияSPPI</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РезультатТестирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветыТестированияSPPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТабличногоДокумента</Name>
					<Comment>Ценные бумаги группируются в табличных документах</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветыПоКритериям</Name>
					<Comment>ТаблицаЗначений("КритерийТестирования": СправочникСсылка.КритерииТестированияSPPI, "Ответ": ПеречислениеСсылка.ОтветыТестированияSPPI)</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТестирования</Name>
					<Comment>Фактическая дата и время последнего редактирования ответов</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, последний раз редактировавший ответы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:DocumentRef.МНО</v8:Type>
						<v8:Type>cfg:CatalogRef.ДепозитныеВклады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ТестированияSPPI/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МенеджерЗаписи = РегистрыСведений.ТестированияSPPI.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация = Запись.Организация;
	МенеджерЗаписи.СчетДоверительногоУправления = Запись.СчетДоверительногоУправления;
	МенеджерЗаписи.Дата = Запись.Дата;
	МенеджерЗаписи.Объект = Запись.Объект;
	МенеджерЗаписи.Прочитать();
	Если Не МенеджерЗаписи.Выбран() Тогда
		Сообщить("Не удалось прочитать данные записи регистра.");
		Возврат;
	КонецЕсли;
	ОтветыПоКритериям.Загрузить(МенеджерЗаписи.ОтветыПоКритериям.Получить());
КонецПроцедуры
